11/data/attachments/a42dbc44f9bbdb20.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Michael_dinner_Friend_24913_1</nif:username>
            <nif:friendToBeRequested>soap_friends_d9d3eed9-e509-469f-aa10-3f2a6f815ba9</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>